#+TITLE: GTD
#+AUTHOR: guanghui
#+TAGS: { WORK(w) Emacs(e)  DREAM(d) OTHER(o)  PROJECT(p) MEETING(m)}

* FireBall                                                          :PROJECT:
:PROPERTIES:
:CATEGORY: cocos2d-x
:END:

** TODO [#B]  Learn some how to extend Unity new GUI.                 :WORK:

1. Understand the source code 

2. Tweak the Source code 

3. Learn how to extend the editor.
** TODO [#A]  Learn Typescript and Egret GUI and Pixi GUI             :WORK:
1. Learn some basic Typescript and set Emacs MacOS X dev env

2. Learn Egret GUI and write some code.

3. Learn Pixi GUI and write some code


* Zilongshanren                                                     :PROJECT:
** Reading                                                         
*** TODO   Read <<SCIP>> books                           
:PROPERTIES:
:END:
   :LOGBOOK:  
   CLOCK: [2015-06-03 Wed 14:31]--[2015-06-03 Wed 14:56] =>  0:25
   CLOCK: [2015-06-02 Tue 10:49]--[2015-06-02 Tue 11:14] =>  0:25
   :END:      
:PROPERTIES:
:LAST_REPEAT: [2015-06-03 Wed 16:39]
:CATEGORY: zilongshanren
:END:

*** TODO  Learn <<Algorithm>> 
:PROPERTIES:
:END:
   :LOGBOOK:
   CLOCK: [2014-10-03 Fri 22:23]--[2014-10-03 Fri 22:48] =>  0:25
   CLOCK: [2014-09-17 Wed 21:51]--[2014-09-17 Wed 22:16] =>  0:25
   CLOCK: [2014-09-16 Tue 21:56]--[2014-09-16 Tue 22:21] =>  0:25
   CLOCK: [2014-09-16 Tue 21:26]--[2014-09-16 Tue 21:51] =>  0:25
   CLOCK: [2014-04-08 Tue 20:52]--[2014-04-08 Tue 21:17] =>  0:25
   CLOCK: [2014-04-01 Tue 22:25]--[2014-04-01 Tue 22:50] =>  0:25
   CLOCK: [2014-03-29 Sat 22:19]--[2014-03-29 Sat 22:32] =>  0:13
   CLOCK: [2014-03-28 Fri 22:14]--[2014-03-28 Fri 22:39] =>  0:25
   CLOCK: [2014-03-28 Fri 21:44]--[2014-03-28 Fri 22:09] =>  0:25
   :END:
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
** Side Project(非正式项目）                              
*** TODO Emacs Chinese Wubi Input Method                                 
:PROPERTIES:
:CATEGORY: zilongshanren
:END:
* Daily Tasks
#+category: Daily
** TODO  Learn basic Gulp                                             :WORK:
** STARTED Visit Reddit                                               :WORK:
:PROPERTIES:
:LAST_REPEAT: [2015-10-11 Sun 17:12]
:END:
- State "DONE"       from "STARTED"    [2015-10-11 Sun 17:12]
- State "DONE"       from "STARTED"    [2015-10-10 Sat 14:40]
- State "DONE"       from "STARTED"    [2015-10-09 Fri 09:30]
- State "DONE"       from "TODO"       [2015-10-08 Thu 00:39]
- State "DONE"       from "TODO"       [2015-09-25 Fri 14:19]
- State "DONE"       from "STARTED"    [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-22 Tue 14:06]
- State "DONE"       from "STARTED"    [2015-09-21 Mon 16:47]
- State "DONE"       from "TODO"       [2015-09-15 Tue 09:25]
- State "DONE"       from "TODO"       [2015-09-14 Mon 10:12]
- State "DONE"       from "TODO"       [2015-09-12 Sat 21:17]
- State "DONE"       from "STARTED"    [2015-09-11 Fri 11:20]
- State "DONE"       from "TODO"       [2015-09-10 Thu 09:41]
- State "DONE"       from "TODO"       [2015-09-07 Mon 09:50]
- State "DONE"       from "TODO"       [2015-09-06 Sun 13:44]
- State "DONE"       from "TODO"       [2015-09-05 Sat 23:39]
- State "DONE"       from "STARTED"    [2015-09-04 Fri 11:51]
- State "DONE"       from "TODO"       [2015-09-01 Tue 10:33]
- State "DONE"       from "TODO"       [2015-08-31 Mon 10:15]
- State "DONE"       from "TODO"       [2015-08-30 Sun 22:40]
- State "DONE"       from "TODO"       [2015-08-29 Sat 21:58]
- State "DONE"       from "STARTED"    [2015-08-28 Fri 09:55]
- State "DONE"       from "TODO"       [2015-08-27 Thu 09:44]
- State "DONE"       from "TODO"       [2015-08-27 Thu 09:44]
- State "DONE"       from "TODO"       [2015-08-25 Tue 16:58]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:35]
- State "DONE"       from "TODO"       [2015-08-17 Mon 11:06]
- State "DONE"       from "STARTED"    [2015-08-14 Fri 10:01]
- State "DONE"       from "TODO"       [2015-08-12 Wed 17:08]
- State "DONE"       from "TODO"       [2015-08-10 Mon 11:01]
- State "DONE"       from "STARTED"    [2015-08-10 Mon 11:00]

SCHEDULED: <2015-10-12 Mon 09:30-09:50 .+1d>
:LOGBOOK:  
CLOCK: [2015-10-12 Mon 13:31]--[2015-10-12 Mon 13:56] =>  0:25
CLOCK: [2015-10-11 Sun 16:40]--[2015-10-11 Sun 17:05] =>  0:25
CLOCK: [2015-10-10 Sat 13:43]--[2015-10-10 Sat 14:08] =>  0:25
CLOCK: [2015-10-09 Fri 08:14]--[2015-10-09 Fri 08:39] =>  0:25
CLOCK: [2015-09-23 Wed 11:36]--[2015-09-23 Wed 11:54] =>  0:18
CLOCK: [2015-09-21 Mon 16:17]--[2015-09-21 Mon 16:42] =>  0:25
CLOCK: [2015-09-11 Fri 11:15]--[2015-09-11 Fri 11:19] =>  0:04
CLOCK: [2015-09-02 Wed 15:15]--[2015-09-02 Wed 15:40] =>  0:25
CLOCK: [2015-08-28 Fri 09:28]--[2015-08-28 Fri 09:53] =>  0:25
CLOCK: [2015-08-14 Fri 09:35]--[2015-08-14 Fri 10:00] =>  0:25
CLOCK: [2015-08-10 Mon 10:10]--[2015-08-10 Mon 10:35] =>  0:25
CLOCK: [2015-07-28 Tue 07:51]--[2015-08-04 Tue 09:17] => 169:26
CLOCK: [2015-07-28 Tue 07:49]--[2015-07-28 Tue 07:51] =>  0:02
CLOCK: [2015-07-17 Fri 09:58]--[2015-07-17 Fri 10:23] =>  0:25
CLOCK: [2015-07-15 Wed 09:30]--[2015-07-15 Wed 09:55] =>  0:25
CLOCK: [2015-07-03 Fri 14:17]--[2015-07-03 Fri 14:42] =>  0:25
CLOCK: [2015-06-25 Thu 09:20]--[2015-06-25 Thu 09:45] =>  0:25
CLOCK: [2015-06-24 Wed 09:34]--[2015-06-24 Wed 09:59] =>  0:25
CLOCK: [2015-06-17 Wed 09:57]--[2015-06-17 Wed 10:22] =>  0:25
CLOCK: [2015-06-15 Mon 09:50]--[2015-06-15 Mon 10:15] =>  0:25
CLOCK: [2015-06-11 Thu 17:38]--[2015-06-11 Thu 18:03] =>  0:25
CLOCK: [2015-06-08 Mon 10:43]--[2015-06-08 Mon 11:08] =>  0:25
CLOCK: [2015-06-05 Fri 09:25]--[2015-06-05 Fri 09:50] =>  0:25
CLOCK: [2015-06-02 Tue 09:39]--[2015-06-02 Tue 10:04] =>  0:25
CLOCK: [2015-05-05 Tue 11:14]--[2015-05-05 Tue 11:39] =>  0:25
CLOCK: [2015-05-04 Mon 10:32]--[2015-05-04 Mon 10:52] =>  0:20
CLOCK: [2015-05-04 Mon 09:48]--[2015-05-04 Mon 10:32] =>  0:44
:END:      
   :PROPERTIES:
   :LAST_REPEAT: [2015-08-25 Tue 16:58]
   :END:
** TODO Read RSS half an  hour                                        :LIFE:
SCHEDULED: <2015-10-13 Tue 13:40 .+1d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-12 Mon 13:43]
:END:
- State "DONE"       from "TODO"       [2015-10-12 Mon 13:43]
- State "DONE"       from "STARTED"    [2015-10-11 Sun 17:50]
- State "DONE"       from "TODO"       [2015-10-10 Sat 11:08]
- State "DONE"       from "TODO"       [2015-10-09 Fri 09:30]
- State "DONE"       from "TODO"       [2015-10-08 Thu 00:39]
- State "DONE"       from "TODO"       [2015-10-06 Tue 20:43]
- State "DONE"       from "TODO"       [2015-09-25 Fri 14:19]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-22 Tue 14:06]
- State "DONE"       from "TODO"       [2015-09-21 Mon 16:14]
- State "DONE"       from "TODO"       [2015-09-15 Tue 09:25]
- State "DONE"       from "TODO"       [2015-09-12 Sat 21:17]
- State "DONE"       from "TODO"       [2015-09-11 Fri 11:20]
- State "DONE"       from "TODO"       [2015-09-10 Thu 09:41]
- State "DONE"       from "TODO"       [2015-09-07 Mon 09:50]
- State "DONE"       from "TODO"       [2015-09-06 Sun 13:44]
- State "DONE"       from "TODO"       [2015-09-05 Sat 23:39]
- State "DONE"       from "TODO"       [2015-09-04 Fri 11:51]
- State "DONE"       from "TODO"       [2015-09-02 Wed 13:36]
- State "DONE"       from "TODO"       [2015-08-31 Mon 10:15]
- State "DONE"       from "TODO"       [2015-08-30 Sun 22:40]
- State "DONE"       from "TODO"       [2015-08-29 Sat 21:58]
- State "DONE"       from "TODO"       [2015-08-28 Fri 09:55]
- State "DONE"       from "TODO"       [2015-08-27 Thu 09:44]
- State "DONE"       from "TODO"       [2015-08-25 Tue 16:58]
- State "DONE"       from "TODO"       [2015-08-23 Sun 15:15]
- State "DONE"       from "TODO"       [2015-08-21 Fri 17:59]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:35]
- State "DONE"       from "TODO"       [2015-08-17 Mon 11:06]
- State "DONE"       from "TODO"       [2015-08-14 Fri 10:01]
- State "DONE"       from "TODO"       [2015-08-13 Thu 11:57]
- State "DONE"       from "STARTED"    [2015-08-12 Wed 11:31]
- State "DONE"       from "STARTED"    [2015-07-21 Tue 13:48]
- State "DONE"       from "TODO"       [2015-07-15 Wed 14:58]
- State "DONE"       from "TODO"       [2015-07-14 Tue 17:23]
- State "DONE"       from "TODO"       [2015-07-07 Tue 13:59]
- State "DONE"       from "STARTED"    [2015-07-06 Mon 15:23]
- State "DONE"       from "TODO"       [2015-07-03 Fri 14:51]
- State "DONE"       from "TODO"       [2015-07-02 Thu 14:30]
- State "DONE"       from "STARTED"    [2015-06-26 Fri 11:59]
:LOGBOOK:  
CLOCK: [2015-10-11 Sun 17:12]--[2015-10-11 Sun 17:37] =>  0:25
CLOCK: [2015-08-05 Wed 15:39]--[2015-08-05 Wed 23:37] =>  7:58
CLOCK: [2015-07-18 Sat 15:49]--[2015-07-18 Sat 18:34] =>  2:45
CLOCK: [2015-07-06 Mon 13:36]--[2015-07-06 Mon 14:01] =>  0:25
CLOCK: [2015-06-25 Thu 15:42]--[2015-06-26 Fri 10:27] => 18:45
CLOCK: [2015-06-19 Fri 13:33]--[2015-06-19 Fri 13:58] =>  0:25
CLOCK: [2015-06-18 Thu 15:21]--[2015-06-18 Thu 15:46] =>  0:25
CLOCK: [2015-06-17 Wed 13:35]--[2015-06-17 Wed 14:00] =>  0:25
CLOCK: [2015-06-16 Tue 14:59]--[2015-06-16 Tue 15:24] =>  0:25
CLOCK: [2015-06-15 Mon 13:37]--[2015-06-15 Mon 13:49] =>  0:12
CLOCK: [2015-06-12 Fri 13:44]--[2015-06-12 Fri 14:09] =>  0:25
CLOCK: [2015-06-11 Thu 16:15]--[2015-06-11 Thu 16:40] =>  0:25
CLOCK: [2015-06-09 Tue 13:37]--[2015-06-09 Tue 14:02] =>  0:25
CLOCK: [2015-05-04 Mon 14:29]--[2015-05-04 Mon 14:54] =>  0:25
:END:      
:PROPERTIES:
:LAST_REPEAT: [2015-08-25 Tue 16:58]
:END:
** STARTED [#B] Fix node and scrollview nested issue                  :WORK:

** TODO  使用 Clojure 搭建一个 Emacs 社区                                 :LIFE:
SCHEDULED: <2015-10-28 Wed>

** TODO  替换 oh-my-zsh 为 antigen,同时为 cocos-console 编写一个 zsh 插件    :LIFE:
"https://github.com/shengyou/codeception-zsh-plugin/blob/master/codeception.plugin.zsh"
"https://askql.wordpress.com/2011/01/11/zsh-writing-own-completion/"
"https://joshldavis.com/2014/07/26/oh-my-zsh-is-a-disease-antigen-is-the-vaccine/"
"http://wikimatze.de/writing-zsh-completion-for-padrino/"

** TODO [#C]  Learn Org Dashboard to management my project, like reading a book or doing a side project. :Emacs:
"http://thehelpfulhacker.net/2014/07/19/a-dashboard-for-your-life-a-minimal-goal-tracker-using-org-mode-go-and-git/"

** TODO [#C] 学习 demo-it package 的用法，同时为我的 git 培训写一个 ppt :Emacs:
[[https://github.com/howardabrams/demo-it][howardabrams/demo-it]]

** TODO [#C]  使用 Emacs 进行项目管理                                :Emacs:
"https://leiyue.wordpress.com/2012/07/04/use-org-mode-and-taskjuggler-to-manage-to-project-information/"
"http://www.devalot.com/articles/2008/07/project-planning"
"http://doc.norang.ca/org-mode.html"
"http://juanreyero.com/article/emacs/org-teams.html"
"http://blog.modelworks.ch/?p=129"

** TODO [#C]  学习 EDebug 和 Ert                                     :Emacs:
[[http://www.gnu.org/software/emacs/manual/html_node/ert/index.html][Emacs Lisp Regression Testing: Top]]
"http://www.gnu.org/software/emacs/manual/html_node/ert/index.html"

** TODO [#B] 重写 Win32 的 EditBox                                    :WORK:
[[http://stackoverflow.com/questions/978632/how-do-i-create-a-normal-win32-edit-control][c - How do I create a normal win32 edit control? - Stack Overflow]]
[[https://msdn.microsoft.com/en-us/library/windows/desktop/hh298433(v%3Dvs.85).aspx][How to Create a Multiline Edit Control (Windows)]]
[[http://www.win32developer.com/tutorial/windows/windows_tutorial_3.shtm][Win32 Developer - Tutorial 3 Using edit boxes, buttons, and other window asset using the Win32 API]]
[[https://msdn.microsoft.com/en-us/library/bb773169(VS.85).aspx][Control Library (Windows)]]

** TODO [#B]  Add Travis CI to my website                             :LIFE:

** TODO [#C] 研究 js2-mode 的各种妙用                                :Emacs:
[[http://blog.binchen.org/posts/why-emacs-is-better-editor.html][Why Emacs is better editor - a case study for javascript developer | Chen's blog]]
[[http://blog.binchen.org/posts/use-which-func-mode-with-js2-mode.html][Use which-func-mode with js2-mode | Chen's blog]]

** STARTED [#B]  修复 Scale9Sprite 进度条缩放的问题                    :WORK:
:LOGBOOK:  
CLOCK: [2015-08-11 Tue 13:55]--[2015-08-11 Tue 14:20] =>  0:25
CLOCK: [2015-08-10 Mon 17:13]--[2015-08-10 Mon 17:38] =>  0:25
CLOCK: [2015-08-10 Mon 17:11]--[2015-08-10 Mon 17:13] =>  0:02
CLOCK: [2015-08-10 Mon 16:38]--[2015-08-10 Mon 17:03] =>  0:25
:END:      

** TODO  给 Org-insert-link 添加 Helm 接口,可以从所有的 Agenda Files 里面选择一个 Headline 并插件链接 :Emacs:

** TODO [#C] 设置 org-agenda 显示周末使用不同的字体,同时设置 org-agenda 显示中国的节日和亲朋好友的 :Emacs:
生日.使用 bbdb 来管理联系人的电话和生日.
[[http://emacs.stackexchange.com/questions/10871/programmatically-add-birthdays-holidays-to-agenda-view-in-org-mode][Programmatically add birthdays/holidays to agenda view in org-mode - Emacs Stack Exchange]]
[[http://emacs.stackexchange.com/questions/10965/easiest-way-to-customize-holidays-that-appear-in-org-agenda][calendar - Easiest way to customize holidays that appear in org-agenda - Emacs Stack Exchange]]
[[http://www.emacswiki.org/emacs/CalendarLocalization#toc20][EmacsWiki: Calendar Localization]]
[[http://xlambda.com/blog/2010/01/11/customize-calendar-in-emacs/][在 emacs calendar 中定制中国农历节日 - X lambda]]


** TODO [#B]  阅读[[http://sachachua.com/blog/2008/01/projects-in-emacs-org/][Projects in Emacs Org - sacha chua :: living an awesome life]]

** TODO Org Custom command 支持过滤掉一些 habit 的任务.                :Emacs:
比如重要且非常紧急的任务,应该是已经 schedule 的,但是不是 habit 任务
[[http://headhole.org/organisation/2012/08/22/org-mode-gtd-and-the-pomodoro-technique/][Headhole - Org-mode, GTD and the Pomodoro technique]]

** STARTED [#B] 阅读<搞定 1>,然后用 Org-mode 来实现之                :Emacs:
:LOGBOOK:  
CLOCK: [2015-08-14 Fri 07:49]--[2015-08-14 Fri 09:34] =>  1:45
:END:      

** TODO Learn Phaser and Clojure
[[http://phaser.io/][Phaser - A fast, fun and free open source HTML5 game framework]]
[[https://github.com/dparis/phzr][dparis/phzr]]
[[https://www.reddit.com/r/Clojure/comments/3h6gso/phzr_a_clojurescript_wrapper_for_the_phaser_html5/][phzr - A ClojureScript wrapper for the Phaser HTML5 game framework : Clojure]]

** TODO  阅读[[http://www.nhplace.com/kent/Papers/Technical-Issues.html][Technical Issues of Separation in Function Cells and Value Cells]]

** TODO  Read the Book <The Art of Unix Programming>
[[http://www.catb.org/esr/writings/taoup/html/index.html][The Art of Unix Programming]]

** TODO [#B]  Learn Javascript                                        :WORK:
SCHEDULED: <2015-10-13 Tue .+2d/3d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-11 Sun 18:15]
:END:
- State "DONE"       from "STARTED"    [2015-10-11 Sun 18:15]
:LOGBOOK:
CLOCK: [2015-10-11 Sun 17:50]--[2015-10-12 Mon 13:31] => 19:41
:END:
http://addyosmani.com/resources/essentialjsdesignpatterns/book/
http://eloquentjavascript.net/
https://github.com/getify/You-Dont-Know-JS/blob/master/es6%20&%20beyond/README.md#you-dont-know-js-es6--beyond
https://leanpub.com/javascriptallongesix/read#leanpub-auto-decaffeinated-impostors
http://exploringjs.com/es6/

** TODO  Add Evil visual mark mode and related toggles               :Emacs:

** TODO  Learn Javascript command line API.                           :WORK:

** TODO  Learn Ploymer Starter Kit                                    :WORK:
https://developers.google.com/web/tools/polymer-starter-kit/

** STARTED [#A] Create a file-browser package                         :WORK:
:LOGBOOK:
CLOCK: [2015-10-09 Fri 11:53]--[2015-10-09 Fri 12:18] =>  0:25
CLOCK: [2015-10-09 Fri 11:08]--[2015-10-09 Fri 11:33] =>  0:25
CLOCK: [2015-10-09 Fri 10:22]--[2015-10-09 Fri 10:48] =>  0:26
CLOCK: [2015-10-09 Fri 09:30]--[2015-10-09 Fri 09:55] =>  0:25
CLOCK: [2015-10-08 Thu 18:11]--[2015-10-08 Thu 18:36] =>  0:25
CLOCK: [2015-10-08 Thu 17:14]--[2015-10-08 Thu 17:39] =>  0:25
CLOCK: [2015-10-08 Thu 15:08]--[2015-10-08 Thu 15:33] =>  0:25
CLOCK: [2015-10-08 Thu 09:24]--[2015-10-08 Thu 09:49] =>  0:25
:END:

** DONE Do exercise for 30 minutes                                    :LIFE:
CLOSED: [2015-10-08 Thu 23:32] SCHEDULED: <2015-10-08 Thu 21:15>
- State "DONE"       from "STARTED"    [2015-10-08 Thu 23:32]
:LOGBOOK:
CLOCK: [2015-10-08 Thu 21:15]--[2015-10-08 Thu 21:40] =>  0:25
:END:

** TODO  Learn the little scheme with javascript.                    :DREAM:

* Weekly Tasks
#+category: Weekly
** TODO [#B]  Record a Spacemacs rocks video.                        :Emacs:
SCHEDULED: <2015-10-17 Sat .+6d/7d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-11 Sun 01:09]
:END:
- State "DONE"       from "TODO"       [2015-10-11 Sun 01:09]
- The video should be within 5 min.
- It should demo a specific feature of Spacemacs

1. navigate your lisp code faster.
2. navigate your source code faster



** TODO Update upstream from Spacemacs and update all the packages from melpa and fix possible issues
SCHEDULED: <2015-10-15 Thu .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-08 Thu 11:39]
:END:
- State "DONE"       from "TODO"       [2015-10-08 Thu 11:39]
** TODO Write a Blog, no matter English or Chinese                    :LIFE:
SCHEDULED: <2015-09-30 Wed .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-09-23 Wed 11:54]
:END:
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "TODO"       [2015-09-23 Wed 11:54]
- State "DONE"       from "STARTED"    [2015-09-04 Fri 11:51]
- State "DONE"       from "TODO"       [2015-08-25 Tue 16:57]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:36]
- State "DONE"       from "TODO"       [2015-08-10 Mon 16:51]
- State "DONE"       from "TODO"       [2015-07-28 Tue 09:23]
- State "DONE"       from "TODO"       [2015-07-13 Mon 09:31]
- State "DONE"       from "TODO"       [2015-07-04 Sat 21:45]
- State "DONE"       from "TODO"       [2015-05-26 Tue 17:26]
   - State "DONE"       from "TODO"       [2015-03-12 Thu 18:05]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-09-30 Tue 08:23]
   - State "DONE"       from "TODO"       [2014-09-15 Mon 09:22]
   - State "DONE"       from "TODO"       [2014-09-08 Mon 23:28]
   - State "DONE"       from "TODO"       [2014-09-01 Mon 10:26]
   - State "DONE"       from "TODO"       [2014-08-25 Mon 09:18]
   - State "DONE"       from "TODO"       [2014-08-13 Wed 09:50]
  - State "DONE"       from "TODO"       [2014-08-02 Sat 07:00]
  :LOGBOOK:
CLOCK: [2015-08-30 Sun 22:55]--[2015-08-30 Sun 23:20] =>  0:25
  CLOCK: [2014-03-30 Sun 22:45]--[2014-03-30 Sun 22:57] =>  0:12
  :END:
:PROPERTIES:
:LAST_REPEAT: [2015-08-25 Tue 16:57]
:END:
** TODO Call my mum                                                   :LIFE:
SCHEDULED: <2015-10-13 Tue 10:00-10:30 .+7d/8d>
:PROPERTIES:
:LAST_REPEAT: [2015-10-06 Tue 20:43]
:END:
- State "DONE"       from "TODO"       [2015-10-06 Tue 20:43]
- State "DONE"       from "TODO"       [2015-09-21 Mon 16:14]
- State "DONE"       from "TODO"       [2015-09-10 Thu 09:41]
- State "DONE"       from "TODO"       [2015-09-01 Tue 10:33]
- State "DONE"       from "TODO"       [2015-08-25 Tue 11:37]
- State "DONE"       from "TODO"       [2015-08-18 Tue 13:35]
- State "DONE"       from "TODO"       [2015-08-11 Tue 08:52]
- State "DONE"       from "TODO"       [2015-08-04 Tue 09:16]
- State "DONE"       from "TODO"       [2015-07-28 Tue 07:49]
- State "DONE"       from "TODO"       [2015-07-21 Tue 09:34]
- State "DONE"       from "TODO"       [2015-07-14 Tue 17:23]
- State "DONE"       from "TODO"       [2015-07-07 Tue 13:59]
- State "DONE"       from "TODO"       [2015-06-30 Tue 09:23]
- State "DONE"       from "TODO"       [2015-06-23 Tue 09:42]
- State "DONE"       from "TODO"       [2015-06-16 Tue 08:54]
- State "DONE"       from "TODO"       [2015-06-09 Tue 11:48]
- State "DONE"       from "TODO"       [2015-06-01 Mon 23:02]
- State "DONE"       from "TODO"       [2015-05-25 Mon 09:36]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:19]
- State "DONE"       from "TODO"       [2015-05-01 Fri 12:42]
- State "DONE"       from "TODO"       [2014-04-07 Mon 20:00]
- State "DONE"       from "STARTED"    [2014-03-29 Sat 10:11]
:PROPERTIES:
:LAST_REPEAT: [2015-08-25 Tue 11:37]
:END:
* Monthly Tasks
#+category: Monthly
** TODO Write a article to summary the fruit of a month               :LIFE:
SCHEDULED: <2015-10-05 Mon .+30d/31d>
:PROPERTIES:
:LAST_REPEAT: [2015-09-05 Sat 23:39]
:END:
- State "DONE"       from "TODO"       [2015-09-05 Sat 23:39]
- State "DONE"       from "TODO"       [2015-08-12 Wed 11:31]
- State "DONE"       from "TODO"       [2015-07-13 Mon 09:31]
- State "DONE"       from "TODO"       [2015-05-08 Fri 15:20]
   - State "DONE"       from "TODO"       [2015-01-19 Mon 09:35]
   - State "DONE"       from "TODO"       [2014-12-16 Tue 14:24]
   - State "DONE"       from "STARTED"    [2014-09-30 Tue 09:39]
   - State "DONE"       from "TODO"       [2014-08-27 Wed 09:53]
   - State "DONE"       from "TODO"       [2014-07-15 Tue 17:42]
   - State "DONE"       from "STARTED"    [2014-05-14 Wed 10:43]
   - State "DONE"       from "STARTED"    [2014-03-30 Sun 22:43]
   :LOGBOOK:
   CLOCK: [2014-09-30 Tue 08:23]--[2014-09-30 Tue 08:49] =>  0:26
   CLOCK: [2014-05-14 Wed 10:13]--[2014-05-14 Wed 10:38] =>  0:25
   CLOCK: [2014-03-30 Sun 22:37]--[2014-03-30 Sun 22:43] =>  0:06
   CLOCK: [2014-03-30 Sun 22:14]--[2014-03-30 Sun 22:26] =>  0:12
   :END:
:PROPERTIES:
:LAST_REPEAT: [2015-08-12 Wed 11:31]
:END:

* Daily Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block today :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-10 Sat 18:32], for Saturday, October 10, 2015.
| File      | Headline                                  | Time   |      |
|-----------+-------------------------------------------+--------+------|
|           | ALL *Total time*                          | *2:55* |      |
|-----------+-------------------------------------------+--------+------|
| gtd.org   | *File time*                               | *0:25* |      |
|           | Daily Tasks                               | 0:25   |      |
|           | \_  TODO Visit Cocos2D-x.org, visit forum |        | 0:25 |
|-----------+-------------------------------------------+--------+------|
| notes.org | *File time*                               | *2:30* |      |
|           | Quick notes                               | 2:30   |      |
|           | \_  DONE Learn Unity UI                   |        | 2:30 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
;; (setq week-range (org-clock-special-range 'today nil t))
;; (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:


# The following section is used for Weekly Review
* Weekly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thisweek :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-10 Sat 18:30], for week 2015-W41.
| File            | Headline                                  | Time   |      |
|-----------------+-------------------------------------------+--------+------|
|                 | ALL *Total time*                          | *9:11* |      |
|-----------------+-------------------------------------------+--------+------|
| gtd.org         | *File time*                               | *4:36* |      |
|                 | Daily Tasks                               | 4:36   |      |
|                 | \_  TODO Visit Cocos2D-x.org, visit forum |        | 0:50 |
|                 | \_  STARTED [#B] Create a file-browser... |        | 3:21 |
|                 | \_  DONE Do exercise for 30 minutes       |        | 0:25 |
|-----------------+-------------------------------------------+--------+------|
| gtd.org_archive | *File time*                               | *0:25* |      |
|                 | DONE Add Chrome refresh function from...  | 0:25   |      |
|-----------------+-------------------------------------------+--------+------|
| notes.org       | *File time*                               | *4:10* |      |
|                 | Quick notes                               | 4:10   |      |
|                 | \_  DONE Learn Unity UI                   |        | 4:10 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
  (setq week-range (org-clock-special-range 'thisweek nil t))
  (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-WORK-] 04:11
: [-LIFE-] 00:25


# The following section is used for Monthly Review
* Monthly Review
#+BEGIN: clocktable :maxlevel 5 :scope agenda-with-archives :block thismonth :fileskip0 t :indent t
#+CAPTION: Clock summary at [2015-10-10 Sat 18:30], for October 2015.
| File            | Headline                                  | Time   |      |
|-----------------+-------------------------------------------+--------+------|
|                 | ALL *Total time*                          | *9:11* |      |
|-----------------+-------------------------------------------+--------+------|
| gtd.org         | *File time*                               | *4:36* |      |
|                 | Daily Tasks                               | 4:36   |      |
|                 | \_  TODO Visit Cocos2D-x.org, visit forum |        | 0:50 |
|                 | \_  STARTED [#B] Create a file-browser... |        | 3:21 |
|                 | \_  DONE Do exercise for 30 minutes       |        | 0:25 |
|-----------------+-------------------------------------------+--------+------|
| gtd.org_archive | *File time*                               | *0:25* |      |
|                 | DONE Add Chrome refresh function from...  | 0:25   |      |
|-----------------+-------------------------------------------+--------+------|
| notes.org       | *File time*                               | *4:10* |      |
|                 | Quick notes                               | 4:10   |      |
|                 | \_  DONE Learn Unity UI                   |        | 4:10 |
#+END:

#+BEGIN_SRC emacs-lisp :results value
(setq week-range (org-clock-special-range 'thismonth nil t))
(org-clock-sum-today-by-tags nil (nth 0 week-range) (nth 1 week-range) t)
#+END_SRC

#+RESULTS:
: [-WORK-] 04:11
: [-LIFE-] 00:25

